Revit.Elements.WallType.Name
The name of the WallType

Revit.Elements.WallType.Width
The width of the WallType

Revit.Elements.WallType.Kind
The kind of the WallType

Revit.Elements.WallType.Function
The function of the WallType

Revit.Elements.WallType.GetThermalProperties
The calculated and settable thermal properties of the WallType
Value of absorptance.
The heat transfer coefficient value (U-Value).
Value of roughness.
The calculated thermal mass value.
The calculated thermal resistance value (R-Value).